spec/mocked_requests/cached_xml/successful_verify_request.xml

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
  <soap:Body>
    <ns2:bpVerifyRequest xmlns:ns2="http://interfaces.core.sw.bps.com/\">
      <return>0</return>
    </ns2:bpVerifyRequest>
  </soap:Body>
</soap:Envelope>